10/data/attachments/706554c8341d9d3b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Erin_finish_Friend_48172_9</nif:username>
            <nif:friendToBeRequested>soap_friends_6a098ebe-a316-49a3-a6fa-8377ab78b4e0</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>